{
    "explications" :{
        "game" :{
            "button" : "Le jeu",
            "texte" :[
                "Jeu d'échecs réalisé en jQuery/javascript",
                "Tout est partis d'un petit projet scolaire pour apprendre à utiliser jQuery, et la gestion du drag'n drop",
                "Ce projet avait pour but de réussir à faire déplacer les pions ... et puis c'était tout.",
                "J'ai trouvé dommage qu'on aille pas plus loin dans la reflexion, et je me suis mis à aprofondir le sujet de mon côté",
                "Au final, cette version permet d'effectuer tout les déplacements de base du jeu d'échecs",
                "En revanche, aucune règles n'a été implémenté : le jeu ne détecte pas les 'pat' ou quand le roi est en échec ou la prise en passant, ou le roc ...",
                "Cela sera le but de la seconde version : faire un jeu qui respecte toutes les règles des échecs"
            ]
        },
        "version" : {
            "button": "A venir ?",
            "texte":[
                "Bon d'abord il faut que j'ajoute les deux règles qui ne sont pas implémentés, puis si j'ai le temps et le courage, j'ai deux idées d'ajout pour ce jeu.",
                "La première idée existe déjà sûrement autre part : au lieu d'être deux devant un même écran, pourquoi ne pas être sur deux écrans différents ? Oui, mettre en place un système de jeu en réseau... à suivre",
                "Seconde idée : pourquoi jouer à deux, quand on peut jouer seul contre l'ordinateur ! Créer une IA qui pourrait vous égaler aux échecs ! J'ai déjà effectué un exposé sur les IA aux échecs et sur l'algorithme qui permet de bien faire réfléchir l'ordinateur sur les coups qu'il va faire",
                "L'algorithme Minmax, très utilisé dans les jeux de plateaux",
                "Mais avant ça, je ferais peut être un jeu plus simple utilisant l'algorithme minmax"
            ]
        },
        "about":{
            "button" : "A propos",
            "texte":[
                "Réalisé par Azarias, ayant comme origine un TP. Avec jQuery",
                "Version du jeu : 1.0",
                "Date de création : 15/02/2015",
                "Dernière modification : 15/02/2015"
            ]
        }
    }
}
